SaitovSP/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>InformationRegister.ИсторияОтказовОтБлюд</registerRecords>
  <registerRecords>InformationRegister.РезервСтолов</registerRecords>
  <registerRecords>AccumulationRegister.СуммаЗаказовКлиенты</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоЗаказовАкция</registerRecords>
  <attributes>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтола</name>
    <type>
      <types>CatalogRef.Столы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидочнаяКарта</name>
    <type>
      <types>CatalogRef.СкидочныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСертификатом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОплаты</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовДляДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеУспешнойДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыдачиЗаказаКурьеру</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыБлюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Повар</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаОтБлюд</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/InformationRegisters/РезервСтолов/РезервСтолов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезервСтолов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Стол</name>
    <type>
      <types>CatalogRef.Столы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/AccumulationRegisters/КоличествоЗаказовАкция/КоличествоЗаказовАкция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КоличествоЗаказовАкция</name>
  <resources>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/AccumulationRegisters/СуммаЗаказовКлиенты/СуммаЗаказовКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СуммаЗаказовКлиенты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/InformationRegisters/ИсторияОтказовОтБлюд/ИсторияОтказовОтБлюд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияОтказовОтБлюд</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Причина</name>
    <type>
      <types>CatalogRef.ПричиныОтказаОтБлюд</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Блюдо</name>
    <type>
      <types>CatalogRef.Блюда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Повар</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/Catalogs/ТипыКарт/ТипыКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыКарт</name>
  <predefined>
    <items>
      <name>КаждыйНБесплатно</name>
      <description>Каждый №  заказ бесплатно</description>
    </items>
    <items>
      <name>КаждыйНСреднийБесплатно</name>
      <description>Каждый № средний бесплатно</description>
    </items>
    <items>
      <name>Скидка</name>
      <description>Скидка</description>
    </items>
  </predefined>
</mdclass:Catalog>

SaitovSP/src/Catalogs/СкидочныеКарты/СкидочныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкидочныеКарты</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартуВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>CatalogRef.ТипыКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/Documents/Заказы/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Резерв Тогда
		Движения.РезервСтолов.Записывать = ИСТИНА;
		Движение = Движения.РезервСтолов.Добавить();
		Движение.ДатаРезерва = ДатаРезерва;
		Движение.Период = Дата;
		Движение.Стол = НомерСтола;
		Возврат;
	КонецЕсли;
	
	СтруктураЗаказыКлиента = КоличествоЗаказовклиента(Клиент);
	
	Если СтруктураЗаказыКлиента.ТипКарты = ПредопределенноеЗначение("Справочник.ТипыКарт.КаждыйНБесплатно")
		И СтруктураЗаказыКлиента.Размер = (СтруктураЗаказыКлиента.КоличествоСделанныхЗаказаов + 1)
		Или
		(СтруктураЗаказыКлиента.ТипКарты = ПредопределенноеЗначение("Справочник.ТипыКарт.КаждыйНСреднийБесплатно")
		И СтруктураЗаказыКлиента.Итого >= Блюда.Итог("Сумма")
		И СтруктураЗаказыКлиента.Размер = (СтруктураЗаказыКлиента.КоличествоСделанныхЗаказаов + 1))
		Тогда
		
		РазмерСкидки = 0;
		Сообщить("Скидка " + СтруктураЗаказыКлиента.ТипКарты + " " +СтруктураЗаказыКлиента.Размер); 
		// регистр КоличествоЗаказовАкция Расход
		Движения.КоличествоЗаказовАкция.Записывать = Истина;
		Движение = Движения.КоличествоЗаказовАкция.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Итого = Итого;
		Движение.Количество = (СтруктураЗаказыКлиента.Размер - 1);
		
	Иначе
		
		// регистр СуммаЗаказовКлиенты 
		Движения.СуммаЗаказовКлиенты.Записывать = Истина;
		Движение = Движения.СуммаЗаказовКлиенты.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.СуммаЗаказа = Итого;
		Движение.Официант = Официант;
		Движение.Ресторан = Ресторан;
		
		// регистр КоличествоЗаказовАкция Приход
		Движения.КоличествоЗаказовАкция.Записывать = Истина;
		Движение = Движения.КоличествоЗаказовАкция.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Итого = Итого;
		Движение.Количество = 1;
		
	КонецЕсли;
	
	Для каждого ТекущаяСтрока Из Блюда Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПричинаОтказа) Тогда
			Движения.ИсторияОтказовОтБлюд.Записывать = Истина;
			Движение 							= Движения.ИсторияОтказовОтБлюд.Добавить();
			Движение.Блюдо 						= ТекущаяСтрока.Блюдо;
			Движение.Повар 						= ТекущаяСтрока.Повар;
			Движение.Официант 					= Официант;
			Движение.Период 					= Дата;
			Движение.Причина 					= ТекущаяСтрока.ПричинаОтказа;
			Движение.ИдентификаторСтроки 		= ТекущаяСтрока.ИдентификаторСтроки;
			Движение.Заказ						= Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция КоличествоЗаказовклиента(Ссылка)
	
	СтруктураЗаказыКлиента = Новый Структура;
	
	СтруктураЗаказыКлиента.Вставить("КоличествоСделанныхЗаказаов", 0);
	СтруктураЗаказыКлиента.Вставить("Итого", 0);
	СтруктураЗаказыКлиента.Вставить("ТипКарты", Неопределено);
	СтруктураЗаказыКлиента.Вставить("Размер", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КоличествоЗаказовАкцияОстатки.КоличествоОстаток КАК КоличествоСделанныхЗаказаов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КоличествоЗаказовАкцияОстатки.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ КоличествоЗаказовАкцияОстатки.ИтогоОстаток / КоличествоЗаказовАкцияОстатки.КоличествоОстаток
	|	КОНЕЦ КАК Итого
	|ИЗ
	|	РегистрНакопления.КоличествоЗаказовАкция.Остатки КАК КоличествоЗаказовАкцияОстатки
	|ГДЕ
	|	КоличествоЗаказовАкцияОстатки.Клиент.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СкидочныеКарты.Размер КАК Размер,
	|	СкидочныеКарты.ТипКарты.Ссылка КАК ТипКартыСсылка
	|ИЗ
	|	Справочник.СкидочныеКарты КАК СкидочныеКарты
	|ГДЕ
	|	СкидочныеКарты.Клиент.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураЗаказыКлиента.Вставить("КоличествоСделанныхЗаказаов", ВыборкаДетальныеЗаписи.КоличествоСделанныхЗаказаов);
		СтруктураЗаказыКлиента.Вставить("Итого", ВыборкаДетальныеЗаписи.Итого);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураЗаказыКлиента.Вставить("ТипКарты", ВыборкаДетальныеЗаписи.ТипКартыСсылка);
		СтруктураЗаказыКлиента.Вставить("Размер", ВыборкаДетальныеЗаписи.Размер);
	КонецЕсли;
	
	Возврат СтруктураЗаказыКлиента;
	
КонецФункции

Функция УстановитьСуммуСертификата(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сертификаты.Сумма КАК Сумма
	|ИЗ
	|	Справочник.Сертификаты КАК Сертификаты
	|ГДЕ
	|	Сертификаты.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
КонецФункции

Функция СертификатОплаты(Код)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", Код);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сертификаты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сертификаты КАК Сертификаты
	|ГДЕ
	|	Сертификаты.Код = &Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
